Repository: 84000/data-translation-memory
Catalog: toh255-v3.tmx
Source language: bo
Languages: en

source: ཐེག་པ་ཆེན་པོའི་མདོ་ཆོས་རྒྱ་མཚོ་ཞེས་བྱ་བ། འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: The Mahāyāna Sūtra The Ocean of Dharma Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱ་མཚོའི་གླིང་ཕྲན་པོ་ཏ་ལ་ཀའི་རི་ལ་རྒྱལ་བའི་སྲས་མི་ལྡོག་པ་ཕལ་པོ་ཆེས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ་བཞུགས་སོ། །
en: The Blessed One was staying at Mount Potalaka, on an island in the ocean, surrounded and attended to by a large gathering of heirs of the victorious ones, who had attained irreversibility.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་གྱི་དབང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། སྐྱེས་བུ་དམ་པ་ཆོས་ཀྱི་གཏམ་ཅི་འདོད་པ་དྲི་བར་གྱིས་ཤིག །
en: The Blessed One addressed the bodhisattva great being Lord of the World, “Wise one, you may ask about any Dharma teaching you like.”

source: ཅེས་པ་དང་། བརྩེ་བ་ལ་བསྒྲིབས་པ་མེད་པས་རྣམ་པར་གྲོལ་བ་ཐོབ་པ། འཇིག་རྟེན་གྱི་དབང་པོ་བྱང་ཆུབ་སེམས་དཔས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་ཇི་ལྟར་ན་གཞོན་ནུར་གྱུར་པས་བདུད་ལས་རྒྱལ་བ་ལགས།
en: Lord of the World, who was liberated through unobscured love, then asked the Blessed One, “Honorable one, how do youthful ones attain victory over Māra?”

source: གང་གིས་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་མ་ཐག་པས་འདོད་པ་ལ་རྟོག་ཅིང་མི་སྟེན་པ་དང་། མི་འཆང་བ་དང་།
en: “The moment you engender the mind of awakening, you will examine desire and will not rely on it.

source: ང་རྒྱལ་མེད་པ་དང་།
en: You will be free and without pride.

source: ཤེས་རབ་དང་། ཐབས་ལ་མཁས་པ་དང་། སྟོང་པ་ཉིད་ལ་ཤིན་ཏུ་མོས་པ་དང་ལྡན་ཏེ།
en: You will possess insight, be skilled in means, and be inspired by emptiness.

source: ཡོད་པ་དང་མེད་པ་སྤངས་པ་དང་། ཡང་དག་པ་མ་ཡིན་པ་ལ་བརྟགས་པས་གྲངས་མེད་པར་ཡང་འཁོར་བར་འགྱུར།
en: You will relinquish existence and nonexistence, and for countless lives, considering it to be unreal, will remain in saṃsāra.”

source: ཇི་ལྟར་ན་དགེ་བར་གསུངས་པའི་ཆོས་དང་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་ཞིང་ཡང་དག་པར་རྫོགས་པའི་བསྙེན་པར་རྫོགས་པ་ལགས།
en: “How does one go forth into the well-taught Dharma and Vinaya and take full ordination correctly?”

source: འགྲོ་བ་ཐ་དད་པའི་ཆོས་རྣམས་ལས་འདས་པ་དང་། གནས་ངན་ལེན་ལ་རྟེན་ཅིང་འཇུག་པའི་སེམས་དང་། ཡིད་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལས་འདས་ཏེ། མི་གཉིས་པའི་ཆོས་ཐོས་པ་ནི་ཤིན་ཏུ་རབ་ཏུ་བྱུང་བའོ། །
en: “To go forth is to transcend the phenomena of different kinds of beings; to transcend the thoughts, mind, and mental consciousnesses that depend on and engage in the bases of suffering; and to hear the teachings on nonduality.

source: སེམས་ཅན་གང་ཐ་དད་པ་འདི་ལྟ་བུས་རབ་ཏུ་བྱུང་བ་དེ་ནི་ཡང་དག་པར་རབ་ཏུ་བྱུང་བའོ། །གང་རབ་ཏུ་བྱུང་ཡང་ཚུལ་ཁྲིམས་དང་། སྤྱོད་ཡུལ་དང་།
en: A being of any different kind who goes forth in this way has truly gone forth.

source: འཚོ་བ་དང་། ལྟ་བ་དང་། བསམ་པ་ཉམས་པ་སྟེ། དེ་ནི་མགོ་དང་། ཁ་སྤུ་བྲེགས་ཀྱང་དོན་མེད་པ་སྟེ།
en: When someone has gone forth, yet has let their discipline, conduct, livelihood, view, and motivation deteriorate, it is pointless for them to shave their heads and beards.

source: རྙོག་པ་འཆང་བས་ན་རྙོག་པ་དེས་ངན་སོང་དུ་གཞོལ་བ་ཡིན་ནོ། །ངས་དད་པས་བྱིན་པ་སྤྱོད་དུ་གནང་བ་ནི་རིགས་པས་གྲོལ་བ་སྟེ།
en: They are bound by disturbances and hence are led by such disturbances to the lower realms.

source: དགེ་སློང་གང་བརྩོན་པ་མི་འདོར་བ་དེས་གཟུགས་མི་འདོར། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་འདོར། ཕུང་པོ་ལྔ་ཐ་དད་པ་དང་། རིལ་གྱིས་བརྟགས་པའི་རང་བཞིན་བས་ན། མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་།
en: “I have granted permission for donations from the faithful to be used by those who are coherent and liberated: that is, monks who while not discarding their perseverance do not discard form, sensation, perception, formation, or consciousness, but examine the five aggregates individually and together and view them as by nature impermanent, as suffering, as empty, and as without self.

source: བདག་མེད་པར་ལྟ་བ་དེ་དག་ཀྱང་མི་དམིགས་པའི་ཚུལ་གྱིས་ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་མ་ཡིན་པར་སྤྲོ་བ་དམ་པར་བྱེད་པས་རྟག་ཏུ་སྒོམ་མོ། །སྙིང་པོ་མེད་པ་དང་། འབྲུམ་པ་ཅན། ཟུག་རྔུ་ཅན་དང་ལྡན་པ། སྐྱོན་ཅན།
en: Yet even these views they always cultivate without apprehending them, and taking the elements and the sense sources strictly as non-existent manifestations.

source: ཕ་རོལ་པོ་སླུ་བའི་ཆོས་ཉིད་ཅེས་སུན་འབྱིན་པ་དེ་དག་ཀྱང་མི་དམིགས་པའི་ཚུལ་དུ་སྦྱོར་བས། གང་ལུས་ཀྱིས་ལུས་ལ་སྲེད་པ་དང་། ལུས་ལ་བྱམས་པ་དང་། ལུས་ལ་བདག་ཡིད་ཆེས་པ་དང་། ལུས་ལ་ཞེན་པ་དེ་དག་རབ་ཏུ་སྤོང་ངོ་། །
en: What they repudiate as being insubstantial, infected, painful, faulty, antagonizing, and of a deceptive nature, they do that too without any apprehending in their approach, and in that way with their bodies give up craving the body, loving the body, believing there is a self in the body, and clinging to the body.

source: གང་འདི་ལྟ་བུའི་དགེ་སློང་ནི་དགེ་བར་གསུངས་པའི་ཆོས་དང་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བར་གྱུར། དད་པས་བསྙེན་པར་རྫོགས་པའི་ཡང་དག་པར་རྫོགས་པ་ཡིན་ཏེ།
en: Monks like this have gone forth into the well-taught Dharma and Vinaya, and have faithfully taken full ordination correctly and completely.

source: འདི་ལྟ་བུའི་དགེ་སློང་ནི་ལྷ་དང་འཇིག་རྟེན་དུ་བཅས་པ་རྣམས་ཀྱི་སྦྱིན་གནས་སུ་གྱུར་པའོ། །
en: Such monks are worthy recipients of donations from the whole world along with its gods.”

source: དེ་ནས་བྱམས་པ་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་གྱི་དབང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ། བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ལས་དགོངས་ཏེ་འགྲོ་བ་ཐ་དད་པའི་ཆོས་རྣམས་ལ་འདས་ཤིང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་ཐོབ་པ་དེ་ནི་དགེ་བར་གསུངས་པའི་ཆོས་དང་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བར་གྱུར། བསྙེན་པར་རྫོགས་པའི་ཡང་དག་པར་རྫོགས་པ་ཞེས་གསུངས།
en: The bodhisattva Maitreya then asked the bodhisattva Lord of the World, “What did the Blessed One mean when he taught, ‘Those who have transcended the phenomena of the different kinds of beings and have attained the phenomena beyond the world have gone forth into the well-taught Dharma and Vinaya and have correctly taken full ordination’?”

source: གཞན་གང་ཞིག་རབ་ཏུ་བྱུང་ཞིང་བསྙེན་པར་རྫོགས་ཀྱང་བདག་བསླུས་པ་སྟེ།
en: “There are other people who may have gone forth and taken full ordination, yet are still confused.

source: ཕ་བོང་ལྟར་བྱི་བ་ཡང་མ་ཡིན། བྱ་ཡང་མ་ཡིན་པ་བཞིན་དུ་དེ་ནི་ཁྱིམ་པ་ཡང་མ་ཡིན།
en: Just as a bat is neither a rat nor a bird, these people are neither householders nor renunciants.

source: རབ་ཏུ་བྱུང་བ་ཡང་མ་ཡིན་པས་ན་གླེན་པའི་སྐྱེས་བུ་དེ་དེ་ལྟ་བུའི་ཚུལ་དུ་ཟུང་ཤིག །
en: Understand the position of these foolish people to be so.

source: སྐྱེས་བུ་དམ་པ་འགྲོ་བ་ཐ་དད་པའི་ཆོས་དེ་དག་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ། དེ་ལས་འདའ་བར་ཡང་མི་ནུས།
en: But, wise one, the phenomena of different kinds of beings are like illusions and, as such, cannot be transcended.

source: འགྲོ་བ་ཐ་དད་པའི་ཆོས་ནི་ཡོངས་སུ་མ་རྫོགས་པས་ན་དེ་ལས་འདའ་བར་ཡང་དཀའ།
en: The phenomena of different kinds of beings are imperfect and, as such, are difficult to transcend.

source: སེམས་ཅན་གྱི་ཁམས་ནི་ཕྱི་ན་ཡང་མེད། ནང་ན་ཡང་མེད་དེ། གཉིས་ཀར་ཡང་དམིགས་སུ་མེད་པས་ན།
en: The realms of beings do not exist outside, do not exist inside, and are not to be apprehended in either.

source: གང་སེམས་ཅན་གྱི་ཁམས་ཀྱི་དངོས་པོ་དེ་ནི་འགྲོ་བ་ཐ་དད་པའི་ཆོས་ཀྱི་དངོས་པོ་སྟེ།
en: Thus, what is an entity of the realms of beings is an entity of the phenomena of different kinds of beings.

source: དེ་ལས་འདའ་བར་ཡང་དཀའ་བ་དེ་ལ་ཀྱེ་རྒྱལ་བའི་སྲས་བཅོམ་ལྡན་འདས་ཀྱིས་འགྲོ་བ་ཐ་དད་པའི་ཆོས་ལས་འདས་ཤིང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐོབ་པའི་དགེ་སློང་དེ་ནི་རབ་ཏུ་བྱུང་བར་གྱུར། བསྙེན་པར་རྫོགས་པར་ཡང་དག་པར་རྫོགས་པ་སྟེ།
en: That is difficult to transcend, and it is in this respect, O heir of the victorious ones, that the Blessed One has taught that someone who has transcended the phenomena of different kinds of beings and attained the phenomena beyond the world has gone forth in the well-taught Dharma and Vinaya, has correctly taken full ordination, and is a worthy recipient of offerings who may use what is donated by the faithful.

source: དེ་ནི་དད་པས་བྱིན་པ་སྤྱོད་པའི་མཆོད་གནས་སུ་གྱུར་པའོ་ཞེས་གསུངས་པ་ཡང་ཀྱེ་རྒྱལ་བའི་སྲས་རྟེན་པའི་གནས་མེད་ན།
en: “O heir of the victorious ones, if there is no solid basis, what could there be to attain?

source: དེ་ལ་འཐོབ་པ་གང་ཅི་སྟེ་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་འཐོབ་པར་འགྱུར་ན་དེ་ནི་དམིགས་པར་གྱུར་པའོ། །
en: If the phenomena beyond the world could be attained, they could be observed.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཉིད་ནི་མི་དམིགས་པ་སྟེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འདི་ལྟར་དགོངས་ནས་འགྲོ་བ་ཐ་དད་པའི་ཆོས་ལས་འདས་ཤིང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐོབ་པ་དེ་ནི་དགེ་སློང་ཡང་དག་པར་གྱུར་པ་སྟེ། དད་པས་བྱིན་པ་སྤྱོད་པའི་མཆོད་གནས་སོ། །དེ་ནས་བྱམས་པ་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་གྱི་དབང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ། བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ལས་དགོངས་ཏེ།
en: The true nature of the thus-gone, worthy, perfect buddhas cannot be observed, and it is from this perspective that the Blessed One taught that someone who has transcended the phenomena of the different realms of beings and attained the phenomena beyond the world is a genuine monk and a worthy recipient of offerings who may use what is donated by the faithful.”

source: བརྩོན་པ་མི་འདོར་བའི་དགེ་སློང་གང་གིས་གཟུགས་མི་འདོར། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་འདོར་བ་དེ་ནི་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་སྟེ། དེ་ནི་དགེ་བར་གསུངས་པའི་ཆོས་ཀྱིས་འདུལ་བ་ལ་ཤིན་ཏུ་རབ་ཏུ་བྱུང་བར་གྱུར་པས་ན་འདི་ལྟ་བུའི་དགེ་སློང་ནི་དད་པས་བྱིན་པ་སྤྱོད་པའི་མཆོད་གནས་སུ་གྱུར་པའོ་ཞེས་གསུངས།
en: The bodhisattva Maitreya asked the bodhisattva Lord of the World, “What did the Blessed One mean when he taught that a monk who while not discarding his perseverance does not discard form, does not discard sensation, perception, formation, or consciousness, is a monk who has gone forth; he is a monk who has fully gone forth into the well-taught Dharma and Vinaya and, as such, is a worthy recipient of offerings who may use what is donated by the faithful?”

source: འཇིག་རྟེན་གྱི་དབང་པོས་སྨྲས་པ། ཀྱེ་རྒྱལ་བའི་སྲས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཉིད་ལ་དགོངས་ཏེ་ཆོས་ཀྱི་དབྱིངས་ནང་ན་ཡང་མེད།
en: The bodhisattva Lord of the World answered, “O heir of the victorious ones, what the Blessed One meant was the true nature.

source: ཕྱི་ན་ཡང་མེད་དེ། གཉི་གར་ཡང་དམིགས་སུ་མེད་པས་ན་ནད་མེད་པར་བཏགས་པ་དང་། མི་སྐྱེ་བར་བཏགས་པ་དང་། མི་འགག་པར་བཏགས་པ་རྣམས་གདགས་སུ་མེད་པ་སྟེ།
en: As the realm of phenomena does not exist outside, does not exist inside, and is not to be apprehended in either, to identify it as being without sickness, identify it as unborn, and identify it as not arising are not designations to be made.

source: སེམས་ཅན་གྱི་ཁམས་མཉམ་པ་བཞིན་དུ་ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད། ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་བཞིན་དུ་སེམས་ཅན་གྱི་ཁམས་མཉམ་པ་ཉིད་དེ།
en: For the sameness of the realm of phenomena accords with the realm of beings being the same, and the sameness of the realm of beings accords with the realm of phenomena being the same.

source: སེམས་ཅན་གྱི་ཁམས་མཉམ་པ་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་དུ་མི་གཉིས་ཏེ། གཉིས་སུ་མེད་དོ། །
en: The sameness of the realm of beings and the sameness of the realm of phenomena are thus not two things and cannot be separated.

source: དེ་མི་གཉིས་ཏེ་གཉིས་སུ་མེད་པས་ན་དེ་ལ་དོར་བ་ཡང་མེད། མི་དོར་བ་ཡང་མེད།
en: Since they are not two things and cannot be separated, there is nothing to be discarded and nothing not to be discarded.

source: གང་དོར་བ་ཡང་མེད། མི་དོར་བ་ཡང་མེད་པས་ན་དེ་ལ་འདའ་བ་དང་།
en: Since there is nothing to be discarded and nothing not to be discarded, it is not possible to transcend or attain anything.

source: ཐོབ་པར་མི་ནུས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འདི་ལྟར་དགོངས་ནས་གདགས་སུ་མེད་པའི་དགེ་སློང་བཏགས་པ་ལ་མི་འཇུག་གོ། །
en: “That is what the Blessed One meant by a monk who is not to be designated not engaging in identifying things.

source: གང་ཡི་གེ་མེད་པའི་དགེ་སློང་ཡི་གེ་ལས་འདས་པ་སྟེ།
en: The monk without any labels transcends labels.

source: དེ་ལ་གྲངས་ཀྱིས་བསྟན་པར་ཡང་མི་རུང་སྟེ།
en: For him, even using a formulation to point things out is not right.

source: དེ་ནི་མི་འོང་མི་འགྲོ་མི་གནས་མི་འདུག་ཉལ་བར་ཡང་མི་རྟོག་གོ། །
en: He does not come, does not go, does not stay, does not sit, and even while sleeping is without concepts.

source: ཞི་བ་དང་ཉེ་བར་ཞི་བ་རྣམས་མི་དམིགས་པའི་དགེ་སློང་ལ་བརྟགས་པ་སྟེ།
en: “Being at peace and bringing to peace are the criteria for monks who have no apprehending.

source: སྤྱོད་པ་རྣམས་ཀྱང་བརྟགས་པའོ། །
en: The ways they behave are criteria, too.

source: ལོག་པ་ལ་རྣམ་པ་མང་དུ་རྟོག་པའི་དགེ་སློང་སྤྱོད་པ་ནི་མ་བརྟགས་པའོ། །
en: The behavior of monks who have all sorts of mistaken concepts is not a criterion.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་ལྟར་དགོངས་ནས་འདི་ལྟ་བུའི་དགེ་སློང་ནི་དད་པས་སྦྱིན་པ་སྤྱོད་པའི་སྦྱིན་གནས་སུ་གྱུར་པའོ། །
en: That is what the Blessed One meant by the former kind of monk being a worthy recipient of offerings who may use what is donated by the faithful.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྤྱན་རས་གཟིགས་དབང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ལ་དགེ་བ་བྱིན་ཏེ་ངས་དགོངས་ཏེ་བཤད་པ་བཞིན་དུ་སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་བསྟན་པ་ནི་དགེའོ་དགེའོ། །
en: The Blessed One then gave the bodhisattva Avalokiteśvara his approval: “Wise one, you have taught in accordance with my meaning. Excellent, excellent indeed!

source: དགེ་བར་གསུངས་པའི་ཆོས་ཀྱི་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བ་འདི་བླ་ན་མེད་པ་དམ་པའི་ཆོས་ཀྱི་ཕྱག་རྒྱ་སྟེ།
en: To go forth into the well-taught Dharma and Vinaya is the seal of the true and unsurpassed Dharma.

source: འདི་ཚུལ་ཁྲིམས་ཉམས་པ་དང་། མ་དུལ་བ་དང་། ང་རྒྱལ་མངོན་པར་བྱེད་པ་རྣམས་ཀྱི་མདུན་དུ་མི་བཤད་པར་གྱིས་ཤིག །
en: Do not teach this in the presence of those who have let their discipline deteriorate, who are untamed, and who are full of pride.

source: དེ་ལྟ་བུ་དེ་དག་རྣམས་ཀྱི་སྙེམས་པ་སྤང་བའི་ཕྱིར་ཕྱག་རྒྱ་འདི་ལ་གང་གིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་རབ་ཀྱིས་བལྟས་ཤིང་མི་དམིགས་པའི་ལུས་མངོན་དུ་བྱས་ན།
en: However, if there are such people who aim to rid themselves of their arrogance, they may use their insight to see this seal of Dharma just as it is and realize the body that is not apprehended.

source: དེས་ཡིད་ཀྱི་ལུས་མྱུར་དུ་འཐོབ་བོ། །
en: If they do so they will quickly attain the mental body.

source: གང་གི་ཡིད་ཀྱི་ལུས་དེས་གྲངས་མེད་པའི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་སྨིན་པར་བྱེད་དོ། །
en: With this mental body, they will ripen countless beings to awakening.”

source: དེ་ནས་ཆོས་ཀྱི་གཞུང་འདི་བཤད་པའི་ཚེ་དགེ་སློང་བདུན་སྟོང་ཟག་པ་མེད་པར་མི་སྐྱེ་བའི་སེམས་རྣམ་པར་གྲོལ་བར་གྱུར།
en: As this Dharma discourse was being delivered, the minds of seven thousand monks were liberated from the defilements into the birthless state.

source: བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བཅུ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར།
en: Ten thousand bodhisattvas attained acceptance that phenomena are unborn.

source: དམིགས་པ་ཅན་གྱི་དགེ་སློང་ལྔ་བརྒྱ་ཆོས་ཀྱི་གཞུང་འདི་མི་སྒྲུབ་ཅིང་མི་འཇུག་པ་དང་།
en: However, five hundred monks who were prone to apprehending did not practice or apply this Dharma discourse.

source: མ་དད་པས་ན་སྟན་ལས་ལངས་ཏེ་དོང་ངོ་། །
en: Lacking faith in it, they rose from their seats and departed.

source: བཅོམ་ལྡན་འདས་ངས་དགོངས་ཏེ་གསུངས་པ་འདི་དག་འཇིག་རྟེན་ཐམས་ཅད་ཡིད་མི་ཆེས་པའི་གཉེན་པོ་ཡིན་པས་ན་ཆོས་ཀྱི་གཞུང་འདི་དམིགས་པ་དང་བཅས་པ་རྣམས་མི་འཐུན་པའོ། །
en: The Blessed One said, “Since what I have intended and said in these teachings is the antidote for all worldly beings’ lack of trust, this Dharma discourse is not in accordance with those who apprehend things.

source: ཡོད་པ་མ་ཡིན་པ་ལ་བརྟེན་པ་རྣམས་དང་མི་འགལ་ཏེ།
en: It is not in contradiction with those who rely on the nonexistence of things.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་བཟུང་བ་རྣམས་དང་། ཟབ་མོའི་ཆོས་ལ་མོས་པ་རྣམས་དང་། སྐྱོ་ཞིང་ཆོག་ཤེས་པས་བསྙུངས་ཏེ་དབེན་པ་ལ་མངོན་པར་དགའ་བ་རྣམས་དང་། སྔོན་གྱི་སངས་རྒྱས་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་པ་རྣམས་ཀྱིས་ངའི་ཆོས་ཀྱི་གཞུང་འདི་ལ་སྟོན་པར་ཤེས་སོ། །
en: Know that this Dharma discourse of mine may be taught by those under the guidance of a spiritual guide, those who find inspiration in profound teachings, those who are dissatisfied with saṃsāra, those who are content with austerity, those who delight in isolated places, and those who have accrued roots of virtue with buddhas of the past.

source: ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ།
en: “O heir of the victorious ones, consider the following analogy.

source: དཔེར་ན་སྐྱེས་བུ་གང་ཞིག་གཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་ན་འགྲོ་བ་མང་པོའི་མདུན་ན་སྨྲ་ཞིང་ཆོས་འཆད་ཀྱང་ཆོས་དེ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མ་གྲགས་ན།
en: Although a person may mistakenly dream in their sleep that they are speaking in front of a crowd of people and teaching the Dharma, they are not actually heard by anyone in the world.

source: ཀྱེ་རྒྱལ་བའི་སྲས་ཅི་འགྲོ་བ་མང་པོ་དེ་རྣམས་ཡོད་དེ། གང་དེས་སངས་རྒྱས་ཀྱི་ཆོས་བཤད་པ་དང་མི་འགལ་བ་སྙམ་དུ་སེམས་སམ།
en: O heir of the victorious ones, what do you think, would the existence of those crowds not contradict that person’s teaching the buddhadharma?”

source: བྱམས་པས་སྨྲས་པ། རྨི་ལམ་ནི་ཡང་དག་པར་མ་མཆིས་པ་སྟེ།
en: Maitreya answered, “Dreams are not real; they are simply delusion.

source: འཁྲུལ་པ་ཙམ་ཞིང་མཆིས་པར་བས་ན་དེ་ངན་འགྲོ་ཕལ་པོ་ཆེ་ལ་ཆོས་འཆད་པར་གྱུར་པ་ལྟ་ག་ལ་ཞིག་མཆིས།
en: So how could he ever have taught the Dharma to crowds of people?”

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྟར་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ནི་རྨི་ལམ་དང་མཚུངས་ཏེ།
en: “O heir of the victorious ones, all phenomena are similar to dreams in the very same way, for they are not real.

source: ཡང་དག་པ་མ་ཡིན་པར་འབྱུང་བར་བྱུང་ནས་ཀྱང་མེད་པར་གྱུར་པ་སྟེ།
en: While they arise, they arise without existing.

source: ཀུན་རྫོབ་ཀྱང་འཁྲུལ་པ་ཙམ་ཞིག་ཡོད་ཀྱི་དོན་དམ་པར་ནི་མ་ཡིན་ནོ། །
en: Although relatively they exist as mere delusion, ultimately they do not exist.

source: འཕགས་པའི་ཤེས་རབ་ཀྱིས་ཇི་ལྟ་བ་མངོན་དུ་བྱས་ན་བསམ་གཏན་སེམས་པའི་བསམ་གཏན་པ་ཡང་མི་དམིགས་པ་སྟེ།
en: Even when the meditation that through noble insight makes this manifest in the mind just as it is, the meditator does not apprehend it.

source: དེ་ལ་ཆོས་ཀྱི་ཚུལ་ཙམ་ཞིག་ཡོད་ཀྱི་ཀུན་ཏུ་བརྟགས་པ་དང་། གཞན་གྱི་དབང་ལས་ཀྱི་རྣམས་ནི་ཡོད་པ་མ་ཡིན་ནོ། །
en: For him it exists only in the manner that phenomena do—they are imputed and the activity of dependent power, not something that exists.

source: དེ་ལྟར་དེ་བཞིན་དུ་ཆོས་འདི་ནི་འཇིག་རྟེན་པ་ཐམས་ཅད་དང་མི་འཐུན་པའོ། །
en: “It is in this way that this teaching is not in accordance with worldly people.

source: ཆོས་འདི་དག་ལ་དམིགས་པ་རྣམས་ཀྱིས་ནི་དོན་དམ་པར་འཛིན་གྱི་འཕགས་པའི་རྣམས་ནི་མི་དམིགས་སོ། །
en: Phenomena are taken as the ultimate truth by those who apprehend them, but the noble ones do not apprehend them.

source: བྱིས་པ་རྣམས་མི་ཤེས་པས་དེ་ལ་མངོན་པར་ཞེན་པས་ན་དམྱལ་བ་དང་། ཡི་དགས་རྣམས་ཀྱི་སྡུག་བསྔལ་གྱིས་ཉོན་མོངས་པ་མྱོང་བར་འགྱུར་རོ། །
en: Childish beings cling to phenomena out of ignorance and thereby end up experiencing the afflictions of suffering in the hell realms and as hungry ghosts.

source: ཆོས་ཀྱི་གཞུང་འདི་ཇི་ལྟ་བ་དེ་ནི་དམིགས་པའོ། །
en: “How this Dharma discourse is, that is apprehended.

source: ཇི་ལྟར་དམིགས་པ་དེ་ནི་ཆོས་ཐམས་ཅད་དོ། །
en: How it is apprehended, so are all phenomena.

source: དེ་ལྟར་དུས་གསུམ་གྱི་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དེ། མི་དམིགས་པས་ན་གང་དམིགས་པ་དེ་ནི་རྟོགས་པའོ། །
en: Because the sameness of all phenomena throughout the three times is not apprehended, what is apprehended is understood.

source: གང་རྟོགས་པ་དེ་ནི་ཐོབ་པ།
en: What is understood is attained.

source: གང་ཐོབ་པ་དེ་ནི་བྱང་ཆུབ།
en: What is attained is awakening.

source: གང་བྱང་ཆུབ་པ་དེ་ནི་དེ་བཞིན་ཉིད།
en: What is awakening is suchness.

source: གང་དེ་བཞིན་ཉིད་པ་དེ་ནི་ཡང་དག་པའི་མཐའ།
en: What is suchness is the limit of reality.

source: གང་ཡང་དག་པའི་མཐའ་དེ་ནི་སྟོང་པ་ཉིད།
en: What is the limit of reality is emptiness.

source: གང་སྟོང་པ་ཉིད་དེ་ནི་མཚན་མ་མེད་པ།
en: What is emptiness is signlessness.

source: གང་མཚན་མ་མེད་པ་དེ་ནི་སྨོན་པ་མེད་པ།
en: What is signlessness is wishlessness.

source: གང་སྨོན་པ་མེད་པ་དེ་ནི་དོན་དམ་པ།
en: What is wishlessness is the ultimate.

source: གང་དོན་དམ་པ་དེ་ནི་ཆོས་ཀྱི་དབྱིངས།
en: What is the ultimate is the realm of phenomena.

source: གང་ཆོས་ཀྱི་དབྱིངས་དེ་ནི་གཉིས་སུ་མེད་པའི་མཐའ།
en: What is the realm of phenomena is the extent of nonduality.

source: གང་གཉིས་སུ་མེད་པའི་མཐའ་དེ་ནི་དབུ་མར་སྒྲུབ་པ།
en: What is the extent of nonduality is the achievement of the middle way.

source: གང་དབུ་མར་སྒྲུབ་པ་དེ་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྐུ་རྟག་པ། བརྟན་པ། མི་འགྱུར་བ་སྟེ། རྟག་པ་ཡང་མ་ཡིན། མི་རྟག་པ་ཡང་མ་ཡིན་ཏེ། དེ་ནི་གདགས་པ་ཡང་མ་ཡིན། མི་གདགས་པ་ཡང་མ་ཡིན།
en: What is the achievement of the middle way is the completely perfect Buddha’s dharma body, which is permanent, perpetual, and unchanging—that is to say, it is neither permanent nor impermanent, neither imputed nor not imputed, and not the one who imputes.

source: གང་གདགས་པ་ཡང་མ་ཡིན། མི་གདགས་པ་ཡང་མ་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་པ་ཡང་མ་ཡིན། འཇིག་རྟེན་ལས་འདས་པ་ཡང་མ་ཡིན།
en: What is not imputed is neither worldly nor transcendent.

source: གང་འཇིག་རྟེན་པ་ཡང་མ་ཡིན། འཇིག་རྟེན་ལས་འདས་པ་ཡང་མ་ཡིན་པ་དེ་ནི་བརྗོད་དུ་མེད་པ།
en: What is neither worldly nor transcendent is ineffable.

source: གང་བརྗོད་དུ་མེད་པ་དེ་ནི་ཆུང་ཟད་ཀྱང་མེད་པ།
en: What is ineffable does not exist even in the slightest.

source: གང་ཆུང་ཟད་ཀྱང་མེད་པ་དེ་ནི་སེམས་ཅན་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཞིང་།
en: What does not exist even in the slightest is the field of merit for beings.

source: གང་སེམས་ཅན་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཞིང་དེ་ནི་སྟོན་པ།
en: What is the field of merit for beings is the Teacher.

source: གང་སྟོན་པ་དེ་ནི་རྣམ་པར་མི་རྟོག་པ།
en: What is the Teacher is the unconceived.

source: གང་རྣམ་པར་མི་རྟོག་པ་དེ་ནི་དམིགས་པ་མེད་པ།
en: What is the unconceived is the absence of apprehending.

source: གང་དམིགས་པ་མེད་པ་དེ་ནི་མི་འགྱུར་བ་གྲུབ་པ།
en: What is the absence of apprehending is unchanging presence.

source: གང་མི་འགྱུར་བ་གྲུབ་པ་དེ་ནི་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་སྟེ། འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཇི་ལྟར་མོས་པ་ཐམས་ཅད་བྱེད་དོ། །
en: What is unchanging presence is the precious, wish-fulfilling jewel, which fulfills all the wishes of beings to be tamed in accordance with their inclinations.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་དེ་དག་གིས་ཚིག་འཐུན་པར་སྨྲས་པ། ཆོས་ཀྱི་གཞུང་འདི་གང་ན་སྤྱོད་པའི་ས་ཕྱོགས་དེ་རྡོ་རྗེ་ལྟ་བུ་སྟེ།
en: Then the many bodhisattvas present spoke in unison: “Any place in which this Dharma discourse is recited will be like vajra.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བཞུགས་པས་ན་སེམས་ཅན་དེ་མྱུར་དུ་མངོན་པར་ཤེས་པ་དང་། དབང་པོ་རྣོན་པོར་འགྱུར་བར་རིག་པར་བྱའོ། །གང་ཞིག་ཆོས་ཀྱི་གཞུང་འདི་ལ་བརྗོད་དམ། འཛིན་ཏམ།
en: Since the buddhas and bodhisattvas will be present there, understand that any being there will swiftly gain the higher perceptions and sharp faculties.

source: ཀློག་གམ། ཆུབ་པར་བྱེད་དམ། ཁ་ཏོན་དུ་བྱེད་དམ། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ན་དེ་བདུད་ཀྱི་དབང་དུ་མི་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་འདི་བཤད་ནས་འཇིག་རྟེན་གྱི་དབང་པོ་དང་།
en: Whoever explains, memorizes, reads aloud, masters, chants, or properly contemplates this Dharma discourse will not fall prey to Māra.”

source: བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། ལྷ་དང་མིར་བཅས་པ་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟའི་འཇིག་རྟེན་རྣམས་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པ་ལ་མངོན་པར་དགའོ། །
en: When the Blessed One had elucidated his intent, bodhisattvas such as Lord of the World, Maitreya, and others, as well as hearers, and the entire world with its gods and humans, asuras, and gandharvas all rejoiced in what the Blessed One had taught.

source: ཐེག་པ་ཆེན་པོའི་མདོ་ཆོས་རྒྱ་མཚོ་ཞེས་བྱ་བ་རྫོགས་སོ།། །།
en: This completes The Mahāyāna Sūtra “The Ocean of Dharma.”

source: རྒྱ་ལས་འགྱུར་བ་སྐད་གསར་ཆད་ཀྱིས་གཏན་ལ་ཕབ་པའོ།། །།
en: Translated from Chinese and established according to the new terminology.
